# Структура квиза
quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Тип данных', 'Язык программирования', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 1
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['float', 'str', 'int', 'natural'],
        'correct_option': 2
    },
    {
        'question': 'Какой оператор используется для присваивания значения переменной?',
        'options': ['==', '=', '!=', '||'],
        'correct_option': 1
    },
    {
        'question': 'Что такое функция?',
        'options': ['Тип данных', 'Блок кода, выполняющий определенное действие', 'Структура данных', 'Условие'],
        'correct_option': 1
    },
    {
        'question': 'Какой метод используется для добавления элемента в список?',
        'options': ['add()', 'insert()', 'push()', 'append()'],
        'correct_option': 3
    },
    {
        'question': 'Что значит OOP?',
        'options': ['Объектно-ориентированное программирование', 'Операционная область программирования', 'Общая операция процесса', 'Объектный оператор Python'],
        'correct_option': 0
    },
    {
        'question': 'Какой символ используется для начала комментария в Python?',
        'options': ['//', '/*', '#', '/*'],
        'correct_option': 2
    },
    {
        'question': 'Какой структуре данных соответствует набор в Python?',
        'options': ['Множество', 'Список', 'Кортеж', 'Словарь'],
        'correct_option': 0
    },
    {
        'question': 'Что такое list comprehension?',
        'options': ['Список с клавиатурным вводом', 'Сжатая запись списка', 'Функция, возвращающая список', 'Список из строк'],
        'correct_option': 1
    },
    {
        'question': 'К какой парадигме программирования относится Python?',
        'options': ['Многофункциональное программирование', 'Процедурное программирование', 'Ориентированное на объекты программирование', 'Функциональное программирование'],
        'correct_option': 0
    },
    {
        'question': 'Вам понравилась наша беседа?',
        'options': ['Круто, мне очень понравилось 🔥', 'Ну не знаю 🙄', 'Воздержусь 😒', 'Мне не понравилось 👿'],
        'correct_option': 0
    }
]